alice_in_wonderland = '"Would you tell me, please, which way I ought to go from here?"\n'\
                      '"That depends a good deal on where you want to get to," said the Cat.\n'\
                      '"I don\'t much care where ——" said Alice.\n'\
                      '"Then it doesn\'t matter which way you go," said the Cat.\n'\
                      '"—— so long as I get somewhere," Alice added as an explanation.\n'\
                      '"Oh, you\'re sure to do that," said the Cat, "if you only walk long enough."'
# task 01 == Розділіть змінну alice_in_wonderland так, щоб вона займала декілька фізичних лінії
# task 02 == Знайдіть та відобразіть всі символи одинарної лапки (') у тексті
# task 03 == Виведіть змінну alice_in_wonderland на друк

print(alice_in_wonderland)

"""
    # Задачі 04 -10:
    # Переведіть задачі з книги "Математика, 5 клас"
    # на мову пітон і виведіть відповідь, так, щоб було
    # зрозуміло дитині, що навчається в п'ятому класі
"""
# task 04
"""
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
Black_sea = 436402
Azov_sea = 37800
print(Black_sea+Azov_sea,'км2')

# task 05
"""
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
sum = 375291
first_and_second = 250449
second_and_third = 222950
first = sum - second_and_third
third = sum - first_and_second
second = sum - first - third
print('first =', first)
print('second =',second)
print('third =',third)

# task 06
"""
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
month = 1179
distance = 12 + 12 // 2
print('sum =', month * distance)

# task 07
"""
Знайди остачу від діленя чисел:
a) 8019 : 8     d) 7248 : 6
b) 9907 : 9     e) 7128 : 5
c) 2789 : 5     f) 19224 : 9
"""
print('a =', 8019%8)
print('b =', 9907%9)
print('c =', 2789%5)
print('d =', 7248%6)
print('e =', 7128%5)
print('f =', 19224%9)

# task 08
"""
Іринка, готуючись до свого дня народження, склала список того,
що їй потрібно замовити. Обчисліть, скільки грошей знадобиться
для даного її замовлення.
Назва товару    Кількість   Ціна
Піца велика     4           274 грн
Піца середня    2           218 грн
Сік             4           35 грн
Торт            1           350 грн
Вода            3           21 грн
"""
pizza_b = 274 * 4
pizza_m = 218 * 2
juice = 35 * 4
cake = 350 * 1
water = 21 * 3
print(pizza_b+pizza_m+juice+cake+water)

# task 09
"""
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
sum = 232
photos_on_page = 8
print(sum//photos_on_page)

# task 10
"""
Родина зібралася в автомобільну подорож із Харкова в Буда-
пешт. Відстань між цими містами становить 1600 км. Відомо,
що на кожні 100 км необхідно 9 літрів бензину. Місткість баку
становить 48 літрів.
1) Скільки літрів бензину знадобиться для такої подорожі?
2) Скільки щонайменше разів родині необхідно заїхати на зап-
равку під час цієї подорожі, кожного разу заправляючи пов-
ний бак?
"""
distance = 1600
consumption = 9
tank_petrol = 48
sum_petrol = distance * consumption // 100
print('Всього потрiбно',sum_petrol,'лiтра бензина')
print('Потрiбно зупинитись',sum_petrol // tank_petrol,'рази')